import 'package:flutter/material.dart';
import 'package:serat/imports.dart';

class Roqia2 extends StatelessWidget {
  const Roqia2({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      body: BlocProvider(
        create: (context) => AzkarCubit(),
        child: const AzkarModelView(
          title: 'الرقية الشرعية من السنة',
          azkarList: [
            'أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ',
            'أَعُوذُ بِوَجْهِ اللَّهِ الْكَرِيمِ ، وَاسْمِ اللَّهِ الْعَظِيمِ ، وَكَلِمَةِ اللَّهِ التَّامَّةِ مِنْ شَرِّ السَّامَّةِ وَاللَّامَّةِ ، وَمِنْ شَرِّ مَا جَهِلْتُ أَيْ رَبِّ ، وَشَرِّ مَا أَنْتَ آخِذٌ بِنَاصِيَتِهِ ، وَمِنْ شَرِّ هَذَا الْيَوْمِ ، وَشَرِّ مَا بَعْدَهُ ، وَشَرِّ الدُّنْيَا وَالْآخِرَةِ .',
            'أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّةِ مِنْ كُلِّ شَيْطَانٍ وَهَامَّةٍ ، وَمِنْ كُلِّ عَيْنٍ لَامَّةٍ .',
            'بِاسْمِ اللَّهِ . ثَلَاثًا ، وَقُلْ سَبْعَ مَرَّاتٍ : أَعُوذُ بِاللَّهِ وَقُدْرَتِهِ مِنْ شَرِّ مَا أَجِدُ وَأُحَاذِرُ .',
            'بِسْمِ اللَّهِ الَّذِي لَا يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الْأَرْضِ وَلَا فِي السَّمَاءِ وَهُوَ السَّمِيعُ الْعَلِيمُ .',
            'بِاسْمِ اللَّهِ أَرْقِيكَ ، مِنْ كُلِّ شَيْءٍ يُؤْذِيكَ ، مِنْ شَرِّ كُلِّ نَفْسٍ ، أَوْ عَيْنِ حَاسِدٍ اللَّهُ يَشْفِيكَ ، بِاسْمِ اللَّهِ أَرْقِيكَ',
            'اللَّهُمَّ رَبَّ النَّاسِ ، مُذْهِبَ الْبَاسِ ، اشْفِ أَنْتَ الشَّافِي ، لَا شَافِيَ إِلَّا أَنْتَ ، شِفَاءً لَا يُغَادِرُ سَقَمًا .',
            'بِاسْمِ اللَّهِ يُبْرِيكَ ، وَمِنْ كُلِّ دَاءٍ يَشْفِيكَ ، وَمِنْ شَرِّ حَاسِدٍ إِذَا حَسَدَ ، وَشَرِّ كُلِّ ذِي عَيْنٍ .',
            'تُرْبَةُ أَرْضِنَا ، وَرِيقَةُ بَعْضِنَا ، يُشْفَى سَقِيمُنَا بِإِذْنِ رَبِّنَا .',
            'لَا إِلَهَ إِلَّا اللَّهُ الْعَظِيمُ الْحَلِيمُ ، لَا إِلَهَ إِلَّا اللَّهُ رَبُّ الْعَرْشِ الْعَظِيمِ ، لَا إِلَهَ إِلَّا اللَّهُ رَبُّ السَّمَاوَاتِ وَرَبُّ الْأَرْضِ وَرَبُّ الْعَرْشِ الْكَرِيمِ .',
            'اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَافِيَةَ فِي الدُّنْيَا وَالْآخِرَةِ ، اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي دِينِي وَدُنْيَايَ وَأَهْلِي وَمَالِي ، اللَّهُمَّ اسْتُرْ عَوْرَتِي وَآمِنْ رَوْعَاتِي ، اللَّهُمَّ احْفَظْنِي مِنْ بَيْنِ يَدَيَّ وَمِنْ خَلْفِي ، وَعَنْ يَمِينِي وَعَنْ شِمَالِي ، وَمِنْ فَوْقِي ، وَأَعُوذُ بِعَظَمَتِكَ أَنْ أُغْتَالَ مِنْ تَحْتِي .',
            'اللَّهُمَّ اغْفِرْ لِي ، وَارْحَمْنِي ، وَاهْدِنِي ، وَعَافِنِي ، وَارْزُقْنِي .',
            'بِاسْمِ اللَّهِ ، اللَّهُمَّ أَذْهِبْ حَرَّهَا وَبَرْدَهَا وَوَصَبَهَا ، قُمْ بِإِذْنِ اللَّهِ .',
            'أَسْأَلُ اللَّهَ الْعَظِيمَ رَبَّ الْعَرْشِ الْعَظِيمِ أَنْ يَشْفِيَكَ .',
            'لَا إِلَهَ إِلَّا اللَّهُ الْعَظِيمُ الْحَلِيمُ ، لَا إِلَهَ إِلَّا اللَّهُ رَبُّ الْعَرْشِ الْعَظِيمِ ، لَا إِلَهَ إِلَّا اللَّهُ رَبُّ السَّمَاوَاتِ وَرَبُّ الْأَرْضِ وَرَبُّ الْعَرْشِ الْكَرِيمِ .',
            'يَا حَيُّ يَا قَيُّومُ ، بِرَحْمَتِكَ أَسْتَغِيثُ .',
            'اللَّهُمَّ رَحْمَتَكَ أَرْجُو ، فَلَا تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْنٍ ، وَأَصْلِحْ لِي شَأْنِي كُلَّهُ ، لَا إِلَهَ إِلَّا أَنْتَ',
            'اللَّهُمَّ إِنِّي أَسْأَلُكَ بِأَنِّي أَشْهَدُ أَنَّكَ أَنْتَ اللَّهُ لَا إِلَهَ إِلَّا أَنْتَ الْأَحَدُ الصَّمَدُ الَّذِي لَمْ يَلِدْ وَلَمْ يُولَدْ وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ .',
            'اللَّهُ اللَّهُ رَبِّي لَا أُشْرِكُ بِهِ شَيْئًا .',
            'اللَّهُمَّ إِنِّي عَبْدُكَ ، وَابْنُ عَبْدِكَ ، ابْنُ أَمَتِكَ ، نَاصِيَتِي بِيَدِكَ ، مَاضٍ فِيَّ حُكْمُكَ ، عَدْلٌ فِيَّ قَضَاؤُكَ ، أَسْأَلُكَ بِكُلِّ اسْمٍ هُوَ لَكَ سَمَّيْتَ بِهِ نَفْسَكَ ، أَوْ أَنْزَلْتَهُ فِي كِتَابِكَ ، أَوْ عَلَّمْتَهُ أَحَدًا مِنْ خَلْقِكَ ، أَوِ اسْتَأْثَرْتَ بِهِ فِي عِلْمِ الْغَيْبِ عِنْدَكَ ، أَنْ تَجْعَلَ الْقُرْآنَ رَبِيعَ قَلْبِي ، وَنُورَ صَدْرِي ، وَجِلَاءَ حُزْنِي ، وَذَهَابَ هَمِّي .',
            'اللَّهُمَّ إِنِّي أَعُوذُ بِرِضَاكَ مِنْ سَخَطِكَ ، وَبِمُعَافَاتِكَ مِنْ عُقُوبَتِكَ ، وَأَعُوذُ بِكَ مِنْكَ ، لَا أُحْصِي ثَنَاءً عَلَيْكَ ، أَنْتَ كَمَا أَثْنَيْتَ عَلَى نَفْسِكَ .',
            'اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْعَجْزِ وَالْكَسَلِ ، وَالْجُبْنِ وَالْبُخْلِ وَالْهَرَمِ ، وَعَذَابِ الْقَبْرِ ، اللَّهُمَّ آتِ نَفْسِي تَقْوَاهَا ، وَزَكِّهَا أَنْتَ خَيْرُ مَنْ زَكَّاهَا ، أَنْتَ وَلِيُّهَا وَمَوْلَاهَا ، اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عِلْمٍ لَا يَنْفَعُ ، وَمِنْ قَلْبٍ لَا يَخْشَعُ ، وَمِنْ نَفْسٍ لَا تَشْبَعُ ، وَمِنْ دَعْوَةٍ لَا يُسْتَجَابُ لَهَا .',
            'اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ ، كَمَا صَلَّيْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ ، إِنَّكَ حَمِيدٌ مَجِيدٌ ، اللَّهُمَّ بَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ ، كَمَا بَارَكْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ ، إِنَّكَ حَمِيدٌ مَجِيدٌ .',
          ],
          maxValues: [
            1,
            1,
            1,
            1,
            1,
            1,
            1,
            1,
            1,
            1,
            1,
            1,
            1,
            7,
            1,
            1,
            1,
            1,
            1,
            1,
            1,
            1,
            1,
          ],
        ),
      ),
    );
  }
}
