import 'package:flutter/material.dart';
import 'package:serat/imports.dart';

class Roqia3 extends StatelessWidget {
  const Roqia3({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      body: BlocProvider(
        create: (context) => AzkarCubit(),
        child: const AzkarModelView(
          title: 'مشروعية الرقية',
          azkarList: [
            'عَنْ عُثْمَانَ بْنِ أَبِي الْعَاصِ قَالَ : لَمَّا اسْتَعْمَلَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى الطَّائِفِ ، جَعَلَ يَعْرِضُ لِي شَيْءٌ فِي صَلَاتِي ، حَتَّى مَا أَدْرِي مَا أُصَلِّي ، فَلَمَّا رَأَيْتُ ذَلِكَ رَحَلْتُ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ : " ابْنُ أَبِي الْعَاصِ ؟ " قُلْتُ : نَعَمْ يَا رَسُولَ اللَّهِ . قَالَ : " مَا جَاءَ بِكَ ؟ " قُلْتُ : يَا رَسُولَ اللَّهِ ، عَرَضَ لِي شَيْءٌ فِي صَلَوَاتِي ، حَتَّى مَا أَدْرِي مَا أُصَلِّي . قَالَ : " ذَاكَ الشَّيْطَانُ ، ادْنُهْ " . فَدَنَوْتُ مِنْهُ ، فَجَلَسْتُ عَلَى صُدُورِ قَدَمَيَّ ، قَالَ : فَضَرَبَ صَدْرِي بِيَدِهِ ، وَتَفَلَ فِي فَمِي وَقَالَ : " اخْرُجْ عَدُوَّ اللَّهِ " . فَفَعَلَ ذَلِكَ ثَلَاثَ مَرَّاتٍ ، ثُمَّ قَالَ : " الْحَقْ بِعَمَلِكَ " . قَالَ : فَقَالَ عُثْمَانُ : فَلَعَمْرِي مَا أَحْسَبُهُ خَالَطَنِي بَعْدُ',
            'عن جَابِر بْن عَبْدِ اللَّهِ يَقُولُ : أَرْخَصَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي رُقْيَةِ الْحَيَّةِ لِبَنِي عَمْرٍو . قَالَ أَبُو الزُّبَيْرِ : وَسَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُ : لَدَغَتْ رَجُلًا مِنَّا عَقْرَبٌ ، وَنَحْنُ جُلُوسٌ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، فَقَالَ رَجُلٌ : يَا رَسُولَ اللَّهِ ، أَرْقِي ؟ قَالَ : " مَنِ اسْتَطَاعَ مِنْكُمْ أَنْ يَنْفَعَ أَخَاهُ فَلْيَفْعَلْ "',
            'عَنْ أَبِي سَعِيدٍ رَضِيَ اللَّهُ عَنْهُ ، قَالَ : انْطَلَقَ نَفَرٌ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي سَفْرَةٍ سَافَرُوهَا ، حَتَّى نَزَلُوا عَلَى حَيٍّ مِنْ أَحْيَاءِ الْعَرَبِ فَاسْتَضَافُوهُمْ ، فَأَبَوْا أَنْ يُضَيِّفُوهُمْ ، فَلُدِغَ سَيِّدُ ذَلِكَ الْحَيِّ ، فَسَعَوْا لَهُ بِكُلِّ شَيْءٍ ، لَا يَنْفَعُهُ شَيْءٌ ، فَقَالَ بَعْضُهُمْ : لَوْ أَتَيْتُمْ هَؤُلَاءِ الرَّهْطَ الَّذِينَ نَزَلُوا ؛ لَعَلَّهُ أَنْ يَكُونَ عِنْدَ بَعْضِهِمْ شَيْءٌ . فَأَتَوْهُمْ فَقَالُوا : يَا أَيُّهَا الرَّهْطُ ، إِنَّ سَيِّدَنَا لُدِغَ وَسَعَيْنَا لَهُ بِكُلِّ شَيْءٍ لَا يَنْفَعُهُ ، فَهَلْ عِنْدَ أَحَدٍ مِنْكُمْ مِنْ شَيْءٍ ؟ فَقَالَ بَعْضُهُمْ : نَعَمْ ، وَاللَّهِ إِنِّي لَأَرْقِي ، وَلَكِنْ وَاللَّهِ لَقَدِ اسْتَضَفْنَاكُمْ فَلَمْ تُضَيِّفُونَا ، فَمَا أَنَا بِرَاقٍ لَكُمْ حَتَّى تَجْعَلُوا لَنَا جُعْلًا . فَصَالَحُوهُمْ عَلَى قَطِيعٍ مِنَ الْغَنَمِ ، فَانْطَلَقَ يَتْفِلُ عَلَيْهِ وَيَقْرَأُ : الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ ، فَكَأَنَّمَا نُشِطَ مِنْ عِقَالٍ ، فَانْطَلَقَ يَمْشِي وَمَا بِهِ قَلَبَةٌ . قَالَ : فَأَوْفَوْهُمْ جُعْلَهُمُ الَّذِي صَالَحُوهُمْ عَلَيْهِ ، فَقَالَ بَعْضُهُمْ : اقْسِمُوا . فَقَالَ الَّذِي رَقَى : لَا تَفْعَلُوا حَتَّى نَأْتِيَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَنَذْكُرَ لَهُ الَّذِي كَانَ ، فَنَنْظُرَ مَا يَأْمُرُنَا . فَقَدِمُوا عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرُوا لَهُ فَقَالَ : " وَمَا يُدْرِيكَ أَنَّهَا رُقْيَةٌ ؟ " . ثُمَّ قَالَ : " قَدْ أَصَبْتُمُ ، اقْسِمُوا وَاضْرِبُوا لِي مَعَكُمْ سَهْمًا " . فَضَحِكَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ',
          ],
          maxValues: [1],
        ),
      ),
    );
  }
}
