import 'package:flutter/material.dart';
import 'package:serat/imports.dart';

class Roqia4 extends StatelessWidget {
  const Roqia4({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      body: BlocProvider(
        create: (context) => AzkarCubit(),
        child: const AzkarModelView(
          title: 'القرآن شفاء لكل داء',
          azkarList: [
            'قال ابن القيم:" قال الله تعالى : {وَنُنَزِّلُ مِنَ الْقُرْآنِ مَا هُوَ شِفَاءٌ وَرَحْمَةٌ لِلْمُؤْمِنِينَ} [الإسراء: 82]، والصحيح أن " من " ها هنا لبيان الجنس لا للتبعيض، وقال تعالى : {يَاأَيُّهَا النَّاسُ قَدْ جَاءَتْكُمْ مَوْعِظَةٌ مِنْ رَبِّكُمْ وَشِفَاءٌ لِمَا فِي الصُّدُورِ} [يونس: 57]. فالقرآن هو الشفاء التام من جميع الأدواء القلبية والبدنية، وأدواء الدنيا والآخرة، وما كل أحد يؤهل، ولا يوفق للاستشفاء به، وإذا أحسن العليل التداوي به ووضعه على دائه بصدق وإيمان وقبول تام واعتقاد جازم واستيفاء شروطه لم يقاومه الداء أبدًا . \n وكيف تقاوم الأدواء كلامَ رب الأرض والسماء ! الذي لو نزل على الجبال لصدعها، أو على الأرض لقطعها، فما من مرض من أمراض القلوب والأبدان إلا وفي القرآن سبيل الدلالة على دوائه وسببه والحمية منه، لمن رزقه الله فهمًا في كتابه، وقد تقدم في أول الكلام على الطب بيان إرشاد القرآن العظيم إلى أصوله ومجامعه، التي هي حفظ الصحة، والحمية، واستفراغ المؤذي، والاستدلال بذلك على سائر أفراد هذه الأنواع . \n وأما الأدوية القلبية فإنه يذكرها مفصلة، ويذكر أسباب أدوائها وعلاجها . قال {أَوَلَمْ يَكْفِهِمْ أَنَّا أَنْزَلْنَا عَلَيْكَ الْكِتَابَ يُتْلَى عَلَيْهِمْ} [العنكبوت: 51]، فمن لم يشفه القرآن فلا شفاه الله ومن لم يكفه فلا كفاه الله ."',
          ],
          maxValues: [1],
        ),
      ),
    );
  }
}
