import 'package:flutter/material.dart';
import 'package:serat/imports.dart';

class Travel3 extends StatelessWidget {
  const Travel3({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      body: BlocProvider(
        create: (context) => AzkarCubit(),
        child: const AzkarModelView(
          title: 'السفر',
          azkarList: [
            'سُبْحَانَ الَّذِي سَخَّرَ لَنَا هَذَا وَمَا كُنَّا لَهُ مُقْرِنِينَ وَإِنَّا إِلَى رَبِّنَا لَمُنْقَلِبُونَ ، اللَّهُمَّ إِنَّا نَسْأَلُكَ فِي سَفَرِنَا هَذَا الْبِرَّ وَالتَّقْوَى ، وَمِنَ الْعَمَلِ مَا تَرْضَى ، اللَّهُمَّ هَوِّنْ عَلَيْنَا سَفَرَنَا هَذَا ، وَاطْوِ عَنَّا بُعْدَهُ ، اللَّهُمَّ أَنْتَ الصَّاحِبُ فِي السَّفَرِ ، وَالْخَلِيفَةُ فِي الْأَهْلِ ، اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ وَعْثَاءِ السَّفَرِ ، وَكَآبَةِ الْمَنْظَرِ ، وَسُوءِ الْمُنْقَلَبِ فِي الْمَالِ وَالْأَهْلِ " . وَإِذَا رَجَعَ قَالَهُنَّ ، وَزَادَ فِيهِنَّ : " آيِبُونَ ، تَائِبُونَ ، عَابِدُونَ ، لِرَبِّنَا حَامِدُونَ',
            'يُكَبِّرُ عَلَى كُلِّ شَرَفٍ مِنَ الْأَرْضِ ثَلَاثَ تَكْبِيرَاتٍ الله أكبر الله أكبر الله أكبر',
            'لَا إِلَهَ إِلَّا اللَّهُ ، وَحْدَهُ لَا شَرِيكَ لَهُ ، لَهُ الْمُلْكُ ، وَلَهُ الْحَمْدُ ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ ، آيِبُونَ ، تَائِبُونَ ، عَابِدُونَ ، سَاجِدُونَ لِرَبِّنَا ، حَامِدُونَ ، صَدَقَ اللَّهُ وَعْدَهُ ، وَنَصَرَ عَبْدَهُ ، وَهَزَمَ الْأَحْزَابَ وَحْدَهُ',
          ],
          maxValues: [1, 3, 1],
        ),
      ),
    );
  }
}
