import 'package:flutter/material.dart';
import 'package:serat/imports.dart';

class Pray16 extends StatelessWidget {
  const Pray16({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      body: BlocProvider(
        create: (context) => AzkarCubit(),
        child: const AzkarModelView(
          title: 'دعاء قنوت الوتر',
          azkarList: [
            'اللَّهُمَّ اهْدِنِي فِيمَنْ هَدَيْتَ ، وَعَافِنِي فِيمَنْ عَافَيْتَ ، وَتَوَلَّنِي فِيمَنْ تَوَلَّيْتَ ، وَبَارِكْ لِي فِيمَا أَعْطَيْتَ ، وَقِنِي شَرَّ مَا قَضَيْتَ ، إِنَّكَ تَقْضِي وَلَا يُقْضَى عَلَيْكَ ، وَإِنَّهُ لَا يَذِلُّ مَنْ وَالَيْتَ ، وَلَا يَعِزُّ مَنْ عَادَيْتَ ، تَبَارَكْتَ رَبَّنَا وَتَعَالَيْتَ',
            'اللَّهُمَّ إِنِّي أَعُوذُ بِرِضَاكَ مِنْ سَخَطِكَ ، وَبِمُعَافَاتِكَ مِنْ عُقُوبَتِكَ ، وَأَعُوذُ بِكَ مِنْكَ ، لَا أُحْصِي ثَنَاءً عَلَيْكَ ، أَنْتَ كَمَا أَثْنَيْتَ عَلَى نَفْسِكَ',
            'اللَّهُمَّ إِنَّا نَسْتَعِينُكَ وَنَسْتَغْفِرُكَ ، وَنُثْنِي عَلَيْكَ الْخَيْرَ وَلَا نَكْفُرُكَ ، وَنَخْلَعُ وَنَتْرُكُ مَنْ يَفْجُرُكَ ، اللَّهُمَّ إِيَّاكَ نَعْبُدُ ، وَلَكَ نُصَلِّي وَنَسْجُدُ ، وَإِلَيْكَ نَسْعَى وَنَحْفِدُ ، نَرْجُو رَحْمَتَكَ وَنَخْشَى عَذَابَكَ ، إِنَّ عَذَابَكَ بِالْكُفَّارِ مُلْحِقٌ ، [ اللَّهُمَّ عَذِّبِ الْكَفَرَةَ وَالْمُشْرِكِينَ ، وَأَلْقِ فِي قُلُوبِهِمُ الرُّعْبَ ، وَخَالِفْ بَيْنَ كَلِمَتِهِمْ ، وَأَنْزِلْ عَلَيْهِمْ رِجْزَكَ وَعَذَابَكَ ، اللَّهُمَّ عَذِّبِ كَفَرَةَ أَهْلِ الْكِتَابِ الَّذِينَ يَصُدُّونَ عَنْ سَبِيلِكَ وَيُكَذِّبُونَ رُسُلَكَ ، اللَّهُمَّ اغْفِرْ لِلْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ وَالْمُسْلِمِينَ وَالْمُسْلِمَاتِ ، اللَّهُمَّ أَصْلِحْ ذَاتَ بَيْنِهِمْ ، وَأَلِّفْ بَيْنَ قُلُوبِهِمْ ، وَاجْعَلْ فِي قُلُوبِهِمُ الْإِيمَانَ وَالْحِكْمَةَ ، وَأَوْزِعْهُمْ أَنْ يَشْكُرُوا نِعْمَتَكَ الَّتِي أَنْعَمْتَ عَلَيْهِمْ ، وَأَنْ يُوفُوا بِعَهْدِكَ الَّذِي عَاهَدْتَهُمْ عَلَيْهِ ، وَتَوَفَّهُمْ عَلَى مِلَّةِ رَسُولِكَ ، وَانْصُرْهُمْ عَلَى عَدُوِّكَ وَعَدُوِّهِمْ إِلَهَ الْحَقِّ وَاجْعَلْنَا مِنْهُمْ ]',
          ],
          maxValues: [1],
        ),
      ),
    );
  }
}
