import 'package:flutter/material.dart';
import 'package:serat/imports.dart';

class Pray13 extends StatelessWidget {
  const Pray13({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      body: BlocProvider(
        create: (context) => AzkarCubit(),
        child: const AzkarModelView(
          title: 'بعد التشهد الأخير',
          azkarList: [
            'اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ جَهَنَّمَ ، وَمِنْ عَذَابِ الْقَبْرِ ، وَمِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ ، وَمِنْ شَرِّ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ',
            'اللَّهُمَّ إِنِّي ظَلَمْتُ نَفْسِي ظُلْمًا كَثِيرًا ، وَلَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ فَاغْفِرْ لِي مَغْفِرَةً مِنْ عِنْدِكَ ، وَارْحَمْنِي إِنَّكَ أَنْتَ الْغَفُورُ الرَّحِيمُ',
            'اللَّهُمَّ اغْفِرْ لِي مَا قَدَّمْتُ ، وَمَا أَخَّرْتُ ، وَمَا أَسْرَرْتُ ، وَمَا أَعْلَنْتُ ، وَمَا أَسْرَفْتُ ، وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّي ؛ أَنْتَ الْمُقَدِّمُ ، وَأَنْتَ الْمُؤَخِّرُ ، لَا إِلَهَ إِلَّا أَنْتَ',
            'اللَّهُمَّ إِنِّي أَسْأَلُكَ الْجَنَّةَ ، وَأَعُوذُ بِكَ مِنَ النَّارِ',
            'اللَّهُمَّ بِعِلْمِكَ الْغَيْبَ وَقُدْرَتِكَ عَلَى الْخَلْقِ ؛ أَحْيِنِي مَا عَلِمْتَ الْحَيَاةَ خَيْرًا لِي ، وَتَوَفَّنِي إِذَا عَلِمْتَ الْوَفَاةَ خَيْرًا لِي ، اللَّهُمَّ وَأَسْأَلُكَ خَشْيَتَكَ فِي الْغَيْبِ وَالشَّهَادَةِ ، وَأَسْأَلُكَ كَلِمَةَ الْحَقِّ فِي الرِّضَا وَالْغَضَبِ ، وَأَسْأَلُكَ الْقَصْدَ فِي الْفَقْرِ وَالْغِنَى ، وَأَسْأَلُكَ نَعِيمًا لَا يَنْفَدُ ، وَأَسْأَلُكَ قُرَّةَ عَيْنٍ لَا تَنْقَطِعُ ، وَأَسْأَلُكَ الرِّضَاءَ بَعْدَ الْقَضَاءِ ، وَأَسْأَلُكَ بَرْدَ الْعَيْشِ بَعْدَ الْمَوْتِ ، وَأَسْأَلُكَ لَذَّةَ النَّظَرِ إِلَى وَجْهِكَ وَالشَّوْقَ إِلَى لِقَائِكَ فِي غَيْرِ ضَرَّاءَ مُضِرَّةٍ وَلَا فِتْنَةٍ مُضِلَّةٍ ، اللَّهُمَّ زَيِّنَّا بِزِينَةِ الْإِيمَانِ ، وَاجْعَلْنَا هُدَاةً مُهْتَدِينَ',
            'اللَّهُمَّ إِنِّي أَسْأَلُكَ يَا اللَّهُ الْأَحَدُ الصَّمَدُ الَّذِي لَمْ يَلِدْ وَلَمْ يُولَدْ ، وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ ؛ أَنْ تَغْفِرَ لِي ذُنُوبِي ؛ إِنَّكَ أَنْتَ الْغَفُورُ الرَّحِيمُ',
            'اللَّهُمَّ أَعِنِّي عَلَى ذِكْرِكَ وَشُكْرِكَ وَحُسْنِ عِبَادَتِكَ',
            'اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْبُخْلِ ، اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْجُبْنِ ، وَأَعُوذُ بِكَ أَنْ أُرَدَّ إِلَى أَرْذَلِ الْعُمُرِ ، وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الدُّنْيَا ، وَأَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ',
            'اللَّهُمَّ إِنِّي أَسْأَلُكَ بِأَنَّ لَكَ الْحَمْدَ ، لَا إِلَهَ إِلَّا أَنْتَ الْمَنَّانُ بَدِيعُ السَّمَوَاتِ وَالْأَرْضِ ، يَا ذَا الْجَلَالِ وَالْإِكْرَامِ ، يَا حَيُّ يَا قَيُّومُ',
          ],
          maxValues: [1],
        ),
      ),
    );
  }
}
