import 'package:flutter/material.dart';
import 'package:serat/imports.dart';

class Pray15 extends StatelessWidget {
  const Pray15({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      body: BlocProvider(
        create: (context) => AzkarCubit(),
        child: const AzkarModelView(
          title: 'دعاء صلاة الاستخارة',
          azkarList: [
            'اللَّهُمَّ إِنِّي أَسْتَخِيرُكَ بِعِلْمِكَ وَأَسْتَقْدِرُكَ بِقُدْرَتِكَ ، وَأَسْأَلُكَ مِنْ فَضْلِكَ الْعَظِيمِ ، فَإِنَّكَ تَقْدِرُ وَلَا أَقْدِرُ ، وَتَعْلَمُ وَلَا أَعْلَمُ ، وَأَنْتَ عَلَّامُ الْغُيُوبِ ، اللَّهُمَّ إِنْ كُنْتَ تَعْلَمُ أَنَّ هَذَا الْأَمْرَ - وَيُسَمِّي حَاجَتَهُ - خَيْرٌ لِي فِي دِينِي ، وَمَعَاشِي ، وَعَاقِبَةِ أَمْرِي " أَوْ قَالَ : " عَاجِلِ أَمْرِي وَآجِلِهِ ، فَاقْدُرْهُ لِي وَيَسِّرْهُ لِي ثُمَّ بَارِكْ لِي فِيهِ ، وَإِنْ كُنْتَ تَعْلَمُ أَنَّ هَذَا الْأَمْرَ - وَيُسَمِّي حَاجَتَهُ - شَرٌّ لِي فِي دِينِي وَمَعَاشِي وَعَاقِبَةِ أَمْرِي " أَوْ قَالَ : " فِي عَاجِلِ أَمْرِي وَآجِلِهِ ، فَاصْرِفْهُ عَنِّي وَاصْرِفْنِي عَنْهُ ، وَاقْدُرْ لِي الْخَيْرَ حَيْثُ كَانَ ، ثُمَّ أَرْضِنِي',
          ],
          maxValues: [1],
        ),
      ),
    );
  }
}
