import 'package:flutter/material.dart';
import 'package:serat/imports.dart';

class Pray9 extends StatelessWidget {
  const Pray9({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      body: BlocProvider(
        create: (context) => AzkarCubit(),
        child: const AzkarModelView(
          title: 'دعاء السجود',
          azkarList: [
            'سُبْحَانَ رَبِّيَ الْأَعْلَى',
            'سُبْحَانَكَ اللَّهُمَّ رَبَّنَا وَبِحَمْدِكَ ، اللَّهُمَّ اغْفِرْ لِي',
            'سُبُّوحٌ قُدُّوسٌ ، رَبُّ الْمَلَائِكَةِ وَالرُّوحِ',
            'اللَّهُمَّ لَكَ سَجَدْتُ ، وَبِكَ آمَنْتُ ، وَلَكَ أَسْلَمْتُ ، سَجَدَ وَجْهِي لِلَّذِي خَلَقَهُ ، وَصَوَّرَهُ ، وَشَقَّ سَمْعَهُ وَبَصَرَهُ ، تَبَارَكَ اللَّهُ أَحْسَنُ الْخَالِقِينَ',
            'سُبْحَانَ ذِي الْجَبَرُوتِ وَالْمَلَكُوتِ وَالْكِبْرِيَاءِ وَالْعَظَمَةِ',
            'اللَّهُمَّ اغْفِرْ لِي ذَنْبِي كُلَّهُ ، دِقَّهُ وَجِلَّهُ ، وَأَوَّلَهُ وَآخِرَهُ ، وَعَلَانِيَتَهُ وَسِرَّهُ',
            'أَعُوذُ بِرِضَاكَ مِنْ سَخَطِكَ ، وَبِمُعَافَاتِكَ مِنْ عُقُوبَتِكَ ، وَأَعُوذُ بِكَ مِنْكَ لَا أُحْصِي ثَنَاءً عَلَيْكَ ، أَنْتَ كَمَا أَثْنَيْتَ عَلَى نَفْسِكَ',
          ],
          maxValues: [3],
        ),
      ),
    );
  }
}
