import 'package:flutter/material.dart';
import 'package:serat/imports.dart';

class Pray5 extends StatelessWidget {
  const Pray5({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      body: BlocProvider(
        create: (context) => AzkarCubit(),
        child: const AzkarModelView(
          title: 'إذا قام من الليل',
          azkarList: [
            'اللَّهُمَّ رَبَّ جَبْرَائِيلَ وَمِيكَائِيلَ وَإِسْرَافِيلَ فَاطِرَ السَّمَوَاتِ وَالْأَرْضِ ، عَالِمَ الْغَيْبِ وَالشَّهَادَةِ أَنْتَ تَحْكُمُ بَيْنَ عِبَادِكَ فِيمَا كَانُوا فِيهِ يَخْتَلِفُونَ ، اهْدِنِي لِمَا اخْتُلِفَ فِيهِ مِنَ الْحَقِّ بِإِذْنِكَ ؛ إِنَّكَ تَهْدِي مَنْ تَشَاءُ إِلَى صِرَاطٍ مُسْتَقِيمٍ',
            'اللَّهُمَّ لَكَ الْحَمْدُ أَنْتَ قَيِّمُ السَّمَوَاتِ وَالْأَرْضِ وَمَنْ فِيهِنَّ ، وَلَكَ الْحَمْدُ لَكَ مُلْكُ السَّمَوَاتِ وَالْأَرْضِ وَمَنْ فِيهِنَّ ، وَلَكَ الْحَمْدُ أَنتَ نُورُ السَّمَوَاتِ وَالْأَرْضِ وَمَنْ فِيهِنَّ ، وَلَكَ الْحَمْدُ أَنْتَ الْحَقُّ وَوَعْدُكَ الْحَقُّ ، وَلِقَاؤُكَ حَقٌّ ، وَقَوْلُكَ حَقٌّ ، وَالْجَنَّةُ حَقٌّ ، وَالنَّارُ حَقٌّ ، وَالنَّبِيُّونَ حَقٌّ ، وَمُحَمَّدٌ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَقٌّ ، وَالسَّاعَةُ حَقٌّ ، اللَّهُمَّ لَكَ أَسْلَمْتُ ، وَبِكَ آمَنْتُ ، وَعَلَيْكَ تَوَكَّلْتُ ، وَإِلَيْكَ أَنَبْتُ ، وَبِكَ خَاصَمْتُ ، وَإِلَيْكَ حَاكَمْتُ ، فَاغْفِرْ لِي مَا قَدَّمْتُ وَمَا أَخَّرْتُ ، وَمَا أَسْرَرْتُ وَمَا أَعْلَنْتُ ، أَنْتَ الْمُقَدِّمُ وَأَنْتَ الْمُؤَخِّرُ ، أَنْتَ إِلَهِي ، لَا إِلَهَ إِلَّا أَنْتَ - أَوْ : لَا إِلَهَ غَيْرُكَ - وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ',
          ],
          maxValues: [1],
        ),
      ),
    );
  }
}
