import 'package:flutter/material.dart';
import 'package:serat/imports.dart';

class Pray3 extends StatelessWidget {
  const Pray3({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      body: BlocProvider(
        create: (context) => AzkarCubit(),
        child: const AzkarModelView(
          title: 'أذكار المسجد',
          azkarList: [
            'دعاء دخول المسجد\nأَعُوذُ بِاللَّهِ الْعَظِيمِ وَبِوَجْهِهِ الْكَرِيمِ وَسُلْطَانِهِ الْقَدِيمِ مِنَ الشَّيْطَانِ الرَّجِيمِ',
            'دعاء دخول المسجد\nصَلَّى عَلَى مُحَمَّدٍ وَسَلَّمَ ، وَقَالَ : " رَبِّ اغْفِرْ لِي ذُنُوبِي ، وَافْتَحْ لِي أَبْوَابَ رَحْمَتِكَ "',
            'دعاء دخول المسجد\nفَلْيُسَلِّمْ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، وَلْيَقُلِ : اللَّهُمَّ افْتَحْ لِي أَبْوَابَ رَحْمَتِكَ',
            'دعاء الخروج الي الصلاه\nاللَّهُمَّ اجْعَلْ فِي قَلْبِي نُورًا ، وَفِي لِسَانِي نُورًا ، وَاجْعَلْ فِي سَمْعِي نُورًا ، وَاجْعَلْ فِي بَصَرِي نُورًا ، وَاجْعَلْ مِنْ خَلْفِي نُورًا ، وَمِنْ أَمَامِي نُورًا ، وَاجْعَلْ مِنْ فَوْقِي نُورًا ، وَمِنْ تَحْتِي نُورًا ، اللَّهُمَّ أَعْطِنِي نُورًاوَاجْعَلْ عَنْ يَمِينِي نُورًا ، وَعَنْ شِمَالِي نُورًا ، اللَّهُمَّ أَعْظِمْ لِي نُورًا',
            'دعاء الخروج الي الصلاه\nاللَّهُمَّ إِنِّي أَسْأَلُكَ بِحَقِّ السَّائِلِينَ عَلَيْكَ ، وَأَسْأَلُكَ بِحَقِّ مَمْشَايَ هَذَا ، فَإِنِّي لَمْ أَخْرُجْ أَشَرًا ، وَلَا بَطَرًا ، وَلَا رِيَاءً ، وَلَا سُمْعَةً ، وَخَرَجْتُ اتِّقَاءَ سُخْطِكَ ، وَابْتِغَاءَ مَرْضَاتِكَ ، فَأَسْأَلُكَ أَنْ تُعِيذَنِي مِنَ النَّارِ ، وَأَنْ تَغْفِرَ لِي ذُنُوبِي ، إِنَّهُ لَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ',
            'دعاء الخروج من المسجد\nصَلَّى عَلَى مُحَمَّدٍ وَسَلَّمَ ، وَقَالَ : " رَبِّ اغْفِرْ لِي ذُنُوبِي ، وَافْتَحْ لِي أَبْوَابَ فَضْلِكَ "',
            'دعاء الخروج من المسجد\nفَلْيُسَلِّمْ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، وَلْيَقُلِ : اللَّهُمَّ اعْصِمْنِي مِنَ الشَّيْطَانِ الرَّجِيمِ "',
          ],
          maxValues: [1],
        ),
      ),
    );
  }
}
