import 'package:flutter/material.dart';
import 'package:serat/imports.dart';

class Pray14 extends StatelessWidget {
  const Pray14({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      body: BlocProvider(
        create: (context) => AzkarCubit(),
        child: const AzkarModelView(
          title: 'الأذكار بعد السلام',
          azkarList: [
            'أستغفر الله',
            'اللَّهُمَّ أَنْتَ السَّلَامُ وَمِنْكَ السَّلَامُ ، تَبَارَكْتَ ذَا الْجَلَالِ وَالْإِكْرَامِ',
            'اللَّهُمَّ أَعِنِّي عَلَى ذِكْرِكَ وَشُكْرِكَ وَحُسْنِ عِبَادَتِكَ',
            'اللَّهُمَّ إِنِّي أَسْأَلُكَ بِأَنَّ لَكَ الْحَمْدَ ، لَا إِلَهَ إِلَّا أَنْتَ الْمَنَّانُ بَدِيعُ السَّمَوَاتِ وَالْأَرْضِ ، يَا ذَا الْجَلَالِ وَالْإِكْرَامِ ، يَا حَيُّ يَا قَيُّومُ',
            'لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ ، اللَّهُمَّ لَا مَانِعَ لِمَا أَعْطَيْتَ ، وَلَا مُعْطِيَ لِمَا مَنَعْتَ ، وَلَا يَنْفَعُ ذَا الْجَدِّ مِنْكِ الْجَدُّ',
            'لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ ، لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ ، لَا إِلَهَ إِلَّا اللَّهُ ، وَلَا نَعْبُدُ إِلَّا إِيَّاهُ ، لَهُ النِّعْمَةُ ، وَلَهُ الْفَضْلُ ، وَلَهُ الثَّنَاءُ الْحَسَنُ ، لَا إِلَهَ إِلَّا اللَّهُ مُخْلِصِينَ لَهُ الدِّينَ وَلَوْ كَرِهَ الْكَافِرُونَ',
            'سبحان الله',
            'الحمد لله',
            'الله أكبر',
            'لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ',
            'بسم الله الرحمن الرحيم\n(قُلْ هُوَ اللَّهُ أَحَدٌ (1) اللَّهُ الصَّمَدُ (2) لَمْ يَلِدْ وَلَمْ يُولَدْ (3) وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ (4)',
            'بسم الله الرحمن الرحيم\nقُلْ أَعُوذُ بِرَبِّ الْفَلَقِ (1) مِنْ شَرِّ مَا خَلَقَ (2) وَمِنْ شَرِّ غَاسِقٍ إِذَا وَقَبَ (3) وَمِنْ شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ (4) وَمِنْ شَرِّ حَاسِدٍ إِذَا حَسَدَ (5)',
            'بسم الله الرحمن الرحيم\nقُلْ أَعُوذُ بِرَبِّ النَّاسِ (1) مَلِكِ النَّاسِ (2) إِلَهِ النَّاسِ (3) مِنْ شَرِّ الْوَسْوَاسِ الْخَنَّاسِ (4) الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ (5) مِنَ الْجِنَّةِ وَالنَّاسِ (6)',
            'اللَّهُ لَا إِلَهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ لَهُ مَا فِي السَّمَوَاتِ وَمَا فِي الْأَرْضِ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلَّا بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلَا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلَّا بِمَا شَاءَ وَسِعَ كُرْسِيُّهُ السَّمَوَاتِ وَالْأَرْضَ وَلَا يَئُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ',
            'الحمد لله',
            'سبحان الله',
            'الله أكبر',
            'اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْبُخْلِ ، اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْجُبْنِ ، وَأَعُوذُ بِكَ أَنْ أُرَدَّ إِلَى أَرْذَلِ الْعُمُرِ ، وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الدُّنْيَا ، وَأَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ',
            'اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْكُفْرِ وَالْفَقْرِ وَعَذَابِ الْقَبْرِ',
            'اللَّهُمَّ اغْفِرْ لِي مَا قَدَّمْتُ ، وَمَا أَخَّرْتُ ، وَمَا أَسْرَرْتُ ، وَمَا أَعْلَنْتُ ، وَمَا أَسْرَفْتُ ، وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّي ؛ أَنْتَ الْمُقَدِّمُ ، وَأَنْتَ الْمُؤَخِّرُ ، لَا إِلَهَ إِلَّا أَنْتَ',
          ],
          maxValues: [
            3,
            1,
            1,
            1,
            1,
            1,
            33,
            33,
            33,
            1,
            1,
            1,
            1,
            10,
            10,
            10,
            1,
            1,
            1,
          ],
        ),
      ),
    );
  }
}
