import 'package:flutter/material.dart';
import 'package:serat/imports.dart';

class Mosque2 extends StatelessWidget {
  const Mosque2({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: const CustomAppBar(title: 'دعاء الخروج الي الصلاه'),
      body: BlocProvider(
        create: (context) => AzkarCubit(),
        child: const AzkarModelView(
          title: 'دعاء الخروج الي الصلاه',
          azkarList: [
            'اللَّهُمَّ اجْعَلْ فِي قَلْبِي نُورًا ، وَفِي لِسَانِي نُورًا ، وَاجْعَلْ فِي سَمْعِي نُورًا ، وَاجْعَلْ فِي بَصَرِي نُورًا ، وَاجْعَلْ مِنْ خَلْفِي نُورًا ، وَمِنْ أَمَامِي نُورًا ، وَاجْعَلْ مِنْ فَوْقِي نُورًا ، وَمِنْ تَحْتِي نُورًا ، اللَّهُمَّ أَعْطِنِي نُورًاوَاجْعَلْ عَنْ يَمِينِي نُورًا ، وَعَنْ شِمَالِي نُورًا ، اللَّهُمَّ أَعْظِمْ لِي نُورًا',
            'اللَّهُمَّ إِنِّي أَسْأَلُكَ بِحَقِّ السَّائِلِينَ عَلَيْكَ ، وَأَسْأَلُكَ بِحَقِّ مَمْشَايَ هَذَا ، فَإِنِّي لَمْ أَخْرُجْ أَشَرًا ، وَلَا بَطَرًا ، وَلَا رِيَاءً ، وَلَا سُمْعَةً ، وَخَرَجْتُ اتِّقَاءَ سُخْطِكَ ، وَابْتِغَاءَ مَرْضَاتِكَ ، فَأَسْأَلُكَ أَنْ تُعِيذَنِي مِنَ النَّارِ ، وَأَنْ تَغْفِرَ لِي ذُنُوبِي ، إِنَّهُ لَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ',
          ],
          maxValues: [1, 1],
        ),
      ),
    );
  }
} 