[
    {
        "id": 1,
        "hadithNumber": "الحديث الأول",
        "hadithText": "عن أمير المؤمنين أبي حفص عمر بن الخطاب رضي الله عنه قال: سمعت رسول الله صلى الله عليه وسلم يقول: \"إنما الأعمال بالنيات، وإنما لكل امرئ ما نوى، فمن كانت هجرته إلى الله ورسوله، فهجرته إلى الله ورسوله، ومن كانت هجرته لدنيا يصيبها أو امرأة ينكحها، فهجرته إلى ما هاجر إليه\".",
        "explanation": "هذا الحديث أصل عظيم في الأعمال، وهو أحد الأحاديث التي عليها مدار الإسلام، وقد قال الشافعي: هذا الحديث ثلث العلم، ويدخل في سبعين باباً من الفقه، وقال أحمد: أصول الإسلام على ثلاثة أحاديث: حديث عمر: \"إنما الأعمال بالنيات\"، وحديث عائشة: \"من أحدث في أمرنا هذا ما ليس منه فهو رد\"، وحديث النعمان بن بشير: \"الحلال بين والحرام بين\".",
        "narrator": "رواه البخاري ومسلم"
    },
    {
        "id": 2,
        "hadithNumber": "الحديث الثاني",
        "hadithText": "عن عمر رضي الله عنه أيضاً قال: بينما نحن جلوس عند رسول الله صلى الله عليه وسلم ذات يوم إذ طلع علينا رجل شديد بياض الثياب شديد سواد الشعر، لا يرى عليه أثر السفر، ولا يعرفه منا أحد، حتى جلس إلى النبي صلى الله عليه وسلم فأسند ركبتيه إلى ركبتيه، ووضع كفيه على فخذيه، وقال: يا محمد أخبرني عن الإسلام، فقال رسول الله صلى الله عليه وسلم: \"الإسلام أن تشهد أن لا إله إلا الله وأن محمداً رسول الله، وتقيم الصلاة، وتؤتي الزكاة، وتصوم رمضان، وتحج البيت إن استطعت إليه سبيلاً\". قال: صدقت. فعجبنا له يسأله ويصدقه. قال: فأخبرني عن الإيمان. قال: \"أن تؤمن بالله، وملائكته، وكتبه، ورسله، واليوم الآخر، وتؤمن بالقدر خيره وشره\". قال: صدقت. قال: فأخبرني عن الإحسان. قال: \"أن تعبد الله كأنك تراه، فإن لم تكن تراه فإنه يراك\". قال: فأخبرني عن الساعة. قال: \"ما المسؤول عنها بأعلم من السائل\". قال: فأخبرني عن أماراتها. قال: \"أن تلد الأمة ربتها، وأن ترى الحفاة العراة العالة رعاء الشاء يتطاولون في البنيان\". ثم انطلق فلبثت ملياً، ثم قال: \"يا عمر أتدري من السائل؟\" قلت: الله ورسوله أعلم. قال: \"فإنه جبريل أتاكم يعلمكم دينكم\".",
        "explanation": "هذا الحديث عظيم الشأن، جامع لأصول الدين وفروعه، وقد اشتمل على بيان الإسلام والإيمان والإحسان، وبيان أشراط الساعة، وهو من الأحاديث التي عليها مدار الإسلام.",
        "narrator": "رواه مسلم"
    },
    {
        "id": 3,
        "hadithNumber": "الحديث الثالث",
        "hadithText": "عن أبي عبد الرحمن عبد الله بن عمر بن الخطاب رضي الله عنهما قال: سمعت رسول الله صلى الله عليه وسلم يقول: \"بني الإسلام على خمس: شهادة أن لا إله إلا الله وأن محمداً رسول الله، وإقام الصلاة، وإيتاء الزكاة، وحج البيت، وصوم رمضان\".",
        "explanation": "هذا الحديث يبين أركان الإسلام الخمسة التي بني عليها، وهي: الشهادتان، والصلاة، والزكاة، والحج، وصوم رمضان. وهذه الأركان هي أساس الإسلام وأعمدته.",
        "narrator": "رواه البخاري ومسلم"
    },
    {
        "id": 4,
        "hadithNumber": "الحديث الرابع",
        "hadithText": "عن أبي عبد الرحمن عبد الله بن مسعود رضي الله عنه قال: حدثنا رسول الله صلى الله عليه وسلم وهو الصادق المصدوق: \"إن أحدكم يجمع خلقه في بطن أمه أربعين يوماً نطفة، ثم يكون علقة مثل ذلك، ثم يكون مضغة مثل ذلك، ثم يرسل إليه الملك فينفخ فيه الروح، ويؤمر بأربع كلمات: بكتب رزقه، وأجله، وعمله، وشقي أو سعيد\".",
        "explanation": "هذا الحديث يبين مراحل خلق الإنسان في بطن أمه، وأن الله تعالى يكتب رزقه وأجله وعمله وشقاوته أو سعادته وهو في بطن أمه.",
        "narrator": "رواه البخاري ومسلم"
    },
    {
        "id": 5,
        "hadithNumber": "الحديث الخامس",
        "hadithText": "عن أم المؤمنين أم عبد الله عائشة رضي الله عنها قالت: قال رسول الله صلى الله عليه وسلم: \"من أحدث في أمرنا هذا ما ليس منه فهو رد\".",
        "explanation": "هذا الحديث يبين أن كل بدعة في الدين مردودة على صاحبها، وأن المسلم يجب عليه أن يتبع ما جاء به النبي صلى الله عليه وسلم ولا يبتدع في الدين ما ليس منه.",
        "narrator": "رواه البخاري ومسلم"
    },
    {
        "id": 6,
        "hadithNumber": "الحديث السادس",
        "hadithText": "عن أبي عبد الله النعمان بن بشير رضي الله عنهما قال: سمعت رسول الله صلى الله عليه وسلم يقول: \"إن الحلال بين، وإن الحرام بين، وبينهما أمور مشتبهات لا يعلمهن كثير من الناس، فمن اتقى الشبهات فقد استبرأ لدينه وعرضه، ومن وقع في الشبهات وقع في الحرام، كالراعي يرعى حول الحمى يوشك أن يرتع فيه، ألا وإن لكل ملك حمى، ألا وإن حمى الله محارمه، ألا وإن في الجسد مضغة إذا صلحت صلح الجسد كله، وإذا فسدت فسد الجسد كله، ألا وهي القلب\".",
        "explanation": "هذا الحديث يبين أن الأمور في الشريعة ثلاثة أقسام: حلال بين، وحرام بين، ومشتبهات بينهما. ويحث على اتقاء الشبهات، ويبين أن القلب هو ملك الجسد، فإذا صلح صلح الجسد كله، وإذا فسد فسد الجسد كله.",
        "narrator": "رواه البخاري ومسلم"
    },
    {
        "id": 7,
        "hadithNumber": "الحديث السابع",
        "hadithText": "عن أبي رقية تميم بن أوس الداري رضي الله عنه أن النبي صلى الله عليه وسلم قال: \"الدين النصيحة\". قلنا: لمن؟ قال: \"لله، ولكتابه، ولرسوله، ولأئمة المسلمين وعامتهم\".",
        "explanation": "هذا الحديث يبين أن الدين كله نصيحة، والنصيحة هي الإخلاص في القول والعمل، والرغبة في الخير للمنصوح له.",
        "narrator": "رواه مسلم"
    },
    {
        "id": 8,
        "hadithNumber": "الحديث الثامن",
        "hadithText": "عن ابن عمر رضي الله عنهما أن رسول الله صلى الله عليه وسلم قال: \"أمرت أن أقاتل الناس حتى يشهدوا أن لا إله إلا الله وأن محمداً رسول الله، ويقيموا الصلاة، ويؤتوا الزكاة، فإذا فعلوا ذلك عصموا مني دماءهم وأموالهم إلا بحق الإسلام، وحسابهم على الله\".",
        "explanation": "هذا الحديث يبين أن المسلم معصوم الدم والمال إلا بحق الإسلام، وأن من أتى بأركان الإسلام الأربعة: الشهادتان، والصلاة، والزكاة، فقد عصم دمه وماله.",
        "narrator": "رواه البخاري ومسلم"
    },
    {
        "id": 9,
        "hadithNumber": "الحديث التاسع",
        "hadithText": "عن أبي هريرة عبد الرحمن بن صخر رضي الله عنه قال: سمعت رسول الله صلى الله عليه وسلم يقول: \"ما نهيتكم عنه فاجتنبوه، وما أمرتكم به فأتوا منه ما استطعتم، فإنما أهلك الذين من قبلكم كثرة مسائلهم واختلافهم على أنبيائهم\".",
        "explanation": "هذا الحديث يبين أن المسلم يجب عليه اجتناب ما نهى عنه النبي صلى الله عليه وسلم، وأن يأتي بما أمر به حسب استطاعته، وأن كثرة السؤال والاختلاف على الأنبياء من أسباب الهلاك.",
        "narrator": "رواه البخاري ومسلم"
    },
    {
        "id": 10,
        "hadithNumber": "الحديث العاشر",
        "hadithText": "عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: \"إن الله طيب لا يقبل إلا طيباً، وإن الله أمر المؤمنين بما أمر به المرسلين، فقال تعالى: {يَا أَيُّهَا الرُّسُلُ كُلُوا مِنَ الطَّيِّبَاتِ وَاعْمَلُوا صَالِحاً} [المؤمنون: 51]، وقال تعالى: {يَا أَيُّهَا الَّذِينَ آمَنُوا كُلُوا مِنْ طَيِّبَاتِ مَا رَزَقْنَاكُمْ} [البقرة: 172]، ثم ذكر الرجل يطيل السفر أشعث أغبر يمد يديه إلى السماء: يا رب يا رب، ومطعمه حرام، ومشربه حرام، وملبسه حرام، وغذي بالحرام، فأنى يستجاب له؟\".",
        "explanation": "هذا الحديث يبين أن الله تعالى طيب لا يقبل إلا طيباً، وأن المسلم يجب عليه أن يأكل من الحلال ويجتنب الحرام، وأن من أكل الحرام لا يستجاب دعاؤه.",
        "narrator": "رواه مسلم"
    },
    {
        "id": 11,
        "hadithNumber": "الحديث الحادي عشر",
        "hadithText": "عن أبي محمد الحسن بن علي بن أبي طالب سبط رسول الله صلى الله عليه وسلم وريحانته رضي الله عنهما قال: حفظت من رسول الله صلى الله عليه وسلم: \"دع ما يريبك إلى ما لا يريبك\".",
        "explanation": "هذا الحديث يحث على ترك الشبهات والتمسك باليقينيات، وأن المسلم يجب عليه أن يترك ما يشك فيه إلى ما لا يشك فيه.",
        "narrator": "رواه الترمذي والنسائي"
    },
    {
        "id": 12,
        "hadithNumber": "الحديث الثاني عشر",
        "hadithText": "عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: \"من حسن إسلام المرء تركه ما لا يعنيه\".",
        "explanation": "هذا الحديث يبين أن من علامات حسن إسلام المرء أن يترك ما لا يعنيه من الأقوال والأفعال، وأن يتفرغ لما يعنيه من أمور دينه ودنياه.",
        "narrator": "رواه الترمذي"
    },
    {
        "id": 13,
        "hadithNumber": "الحديث الثالث عشر",
        "hadithText": "عن أبي حمزة أنس بن مالك رضي الله عنه خادم رسول الله صلى الله عليه وسلم عن النبي صلى الله عليه وسلم قال: \"لا يؤمن أحدكم حتى يحب لأخيه ما يحب لنفسه\".",
        "explanation": "هذا الحديث يبين أن من كمال الإيمان أن يحب المسلم لأخيه ما يحب لنفسه من الخير، وأن يبغض له ما يبغض لنفسه من الشر.",
        "narrator": "رواه البخاري ومسلم"
    },
    {
        "id": 14,
        "hadithNumber": "الحديث الرابع عشر",
        "hadithText": "عن ابن مسعود رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: \"لا يحل دم امرئ مسلم يشهد أن لا إله إلا الله وأني رسول الله إلا بإحدى ثلاث: الثيب الزاني، والنفس بالنفس، والتارك لدينه المفارق للجماعة\".",
        "explanation": "هذا الحديث يبين أن دم المسلم معصوم إلا في ثلاث حالات: الزنا بعد الإحصان، والقتل العمد، والردة عن الإسلام.",
        "narrator": "رواه البخاري ومسلم"
    },
    {
        "id": 15,
        "hadithNumber": "الحديث الخامس عشر",
        "hadithText": "عن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال: \"من كان يؤمن بالله واليوم الآخر فليقل خيراً أو ليصمت، ومن كان يؤمن بالله واليوم الآخر فليكرم جاره، ومن كان يؤمن بالله واليوم الآخر فليكرم ضيفه\".",
        "explanation": "هذا الحديث يبين أن من علامات الإيمان: حفظ اللسان، وإكرام الجار، وإكرام الضيف.",
        "narrator": "رواه البخاري ومسلم"
    },
    {
        "id": 16,
        "hadithNumber": "الحديث السادس عشر",
        "hadithText": "عن أبي هريرة رضي الله عنه أن رجلاً قال للنبي صلى الله عليه وسلم: أوصني. قال: \"لا تغضب\". فردد مراراً، قال: \"لا تغضب\".",
        "explanation": "هذا الحديث يبين أن الغضب من الأمور التي يجب على المسلم أن يتجنبها، وأن كظم الغضب من علامات التقوى.",
        "narrator": "رواه البخاري"
    },
    {
        "id": 17,
        "hadithNumber": "الحديث السابع عشر",
        "hadithText": "عن أبي يعلى شداد بن أوس رضي الله عنه عن رسول الله صلى الله عليه وسلم قال: \"إن الله كتب الإحسان على كل شيء، فإذا قتلتم فأحسنوا القتلة، وإذا ذبحتم فأحسنوا الذبحة، وليحد أحدكم شفرته، وليرح ذبيحته\".",
        "explanation": "هذا الحديث يبين أن الإحسان مطلوب في كل شيء، حتى في القتل والذبح، وأن المسلم يجب عليه أن يحسن في كل أعماله.",
        "narrator": "رواه مسلم"
    },
    {
        "id": 18,
        "hadithNumber": "الحديث الثامن عشر",
        "hadithText": "عن أبي ذر جندب بن جنادة وأبي عبد الرحمن معاذ بن جبل رضي الله عنهما عن رسول الله صلى الله عليه وسلم قال: \"اتق الله حيثما كنت، وأتبع السيئة الحسنة تمحها، وخالق الناس بخلق حسن\".",
        "explanation": "هذا الحديث يبين أن المسلم يجب عليه أن يتقي الله في كل مكان، وأن يتبع السيئة بالحسنة، وأن يحسن معاملة الناس.",
        "narrator": "رواه الترمذي"
    },
    {
        "id": 19,
        "hadithNumber": "الحديث التاسع عشر",
        "hadithText": "عن أبي العباس عبد الله بن عباس رضي الله عنهما قال: كنت خلف النبي صلى الله عليه وسلم يوماً فقال: \"يا غلام إني أعلمك كلمات: احفظ الله يحفظك، احفظ الله تجده تجاهك، إذا سألت فاسأل الله، وإذا استعنت فاستعن بالله، واعلم أن الأمة لو اجتمعت على أن ينفعوك بشيء لم ينفعوك إلا بشيء قد كتبه الله لك، ولو اجتمعت على أن يضروك بشيء لم يضروك إلا بشيء قد كتبه الله عليك، رفعت الأقلام وجفت الصحف\".",
        "explanation": "هذا الحديث يبين أن حفظ الله تعالى يقتضي حفظ العبد في دينه ودنياه، وأن كل شيء بقدر الله تعالى.",
        "narrator": "رواه الترمذي"
    },
    {
        "id": 20,
        "hadithNumber": "الحديث العشرون",
        "hadithText": "عن أبي مسعود عقبة بن عمرو الأنصاري البدري رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: \"إن مما أدرك الناس من كلام النبوة الأولى: إذا لم تستح فاصنع ما شئت\".",
        "explanation": "هذا الحديث يبين أن الحياء من خصال النبوة، وأن من لم يكن له حياء فعل ما شاء من القبائح.",
        "narrator": "رواه البخاري"
    },
    {
        "id": 21,
        "hadithNumber": "الحديث الحادي والعشرون",
        "hadithText": "عن أبي عمرو - وقيل: أبي عمرة - سفيان بن عبد الله رضي الله عنه قال: قلت: يا رسول الله، قل لي في الإسلام قولاً لا أسأل عنه أحداً غيرك. قال: \"قل: آمنت بالله، ثم استقم\".",
        "explanation": "هذا الحديث يبين أن الإيمان بالله والاستقامة على طاعته هما أساس الإسلام، وأن المسلم يجب عليه أن يلتزم بهما.",
        "narrator": "رواه مسلم"
    },
    {
        "id": 22,
        "hadithNumber": "الحديث الثاني والعشرون",
        "hadithText": "عن أبي عبد الله جابر بن عبد الله الأنصاري رضي الله عنهما أن رجلاً سأل رسول الله صلى الله عليه وسلم فقال: أرأيت إذا صليت المكتوبات، وصمت رمضان، وأحللت الحلال، وحرمت الحرام، ولم أزد على ذلك شيئاً، أدخل الجنة؟ قال: \"نعم\".",
        "explanation": "هذا الحديث يبين أن من أدى الفرائض واجتنب المحرمات دخل الجنة، وأن هذه الأمور هي أساس الإسلام.",
        "narrator": "رواه مسلم"
    },
    {
        "id": 23,
        "hadithNumber": "الحديث الثالث والعشرون",
        "hadithText": "عن أبي مالك الحارث بن عاصم الأشعري رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: \"الطهور شطر الإيمان، والحمد لله تملأ الميزان، وسبحان الله والحمد لله تملآن - أو تملأ - ما بين السماوات والأرض، والصلاة نور، والصدقة برهان، والصبر ضياء، والقرآن حجة لك أو عليك، كل الناس يغدو، فبائع نفسه فمعتقها أو موبقها\".",
        "explanation": "هذا الحديث يبين فضل الطهارة والذكر والصلاة والصدقة والصبر والقرآن، وأن الإنسان يبيع نفسه إما للجنة وإما للنار.",
        "narrator": "رواه مسلم"
    },
    {
        "id": 24,
        "hadithNumber": "الحديث الرابع والعشرون",
        "hadithText": "عن أبي ذر الغفاري رضي الله عنه عن النبي صلى الله عليه وسلم فيما يرويه عن ربه عز وجل أنه قال: \"يا عبادي إني حرمت الظلم على نفسي وجعلته بينكم محرماً فلا تظالموا، يا عبادي كلكم ضال إلا من هديته فاستهدوني أهدكم، يا عبادي كلكم جائع إلا من أطعمته فاستطعموني أطعمكم، يا عبادي كلكم عار إلا من كسوته فاستكسوني أكسكم، يا عبادي إنكم تخطئون بالليل والنهار وأنا أغفر الذنوب جميعاً فاستغفروني أغفر لكم، يا عبادي إنكم لن تبلغوا ضري فتضروني، ولن تبلغوا نفعي فتنفعوني، يا عبادي لو أن أولكم وآخركم وإنسكم وجنكم كانوا على أتقى قلب رجل واحد منكم ما زاد ذلك في ملكي شيئاً، يا عبادي لو أن أولكم وآخركم وإنسكم وجنكم كانوا على أفجر قلب رجل واحد منكم ما نقص ذلك من ملكي شيئاً، يا عبادي لو أن أولكم وآخركم وإنسكم وجنكم قاموا في صعيد واحد فسألوني فأعطيت كل إنسان مسألته ما نقص ذلك مما عندي إلا كما ينقص المخيط إذا أدخل البحر، يا عبادي إنما هي أعمالكم أحصيها لكم ثم أوفيكم إياها، فمن وجد خيراً فليحمد الله، ومن وجد غير ذلك فلا يلومن إلا نفسه\".",
        "explanation": "هذا الحديث يبين أن الله تعالى حرم الظلم على نفسه وجعله محرماً بين عباده، وأن العباد جميعاً محتاجون إلى الله تعالى في كل شيء، وأن أعمالهم هي التي تحاسب عليها.",
        "narrator": "رواه مسلم"
    },
    {
        "id": 25,
        "hadithNumber": "الحديث الخامس والعشرون",
        "hadithText": "عن أبي ذر رضي الله عنه أيضاً أن أناساً من أصحاب رسول الله صلى الله عليه وسلم قالوا للنبي صلى الله عليه وسلم: يا رسول الله، ذهب أهل الدثور بالأجور، يصلون كما نصلي، ويصومون كما نصوم، ويتصدقون بفضول أموالهم. قال: \"أوليس قد جعل الله لكم ما تصدقون به؟ إن بكل تسبيحة صدقة، وكل تكبيرة صدقة، وكل تحميدة صدقة، وكل تهليلة صدقة، وأمر بالمعروف صدقة، ونهي عن المنكر صدقة، وفي بضع أحدكم صدقة\". قالوا: يا رسول الله، أيأتي أحدنا شهوته ويكون له فيها أجر؟ قال: \"أرأيتم لو وضعها في حرام أكان عليه وزر؟ فكذلك إذا وضعها في الحلال كان له أجر\".",
        "explanation": "هذا الحديث يبين أن الصدقة ليست مقصورة على المال، بل كل عمل صالح صدقة، وأن المسلم يؤجر على كل عمل صالح يقوم به.",
        "narrator": "رواه مسلم"
    },
    {
        "id": 26,
        "hadithNumber": "الحديث السادس والعشرون",
        "hadithText": "عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: \"كل سلامى من الناس عليه صدقة، كل يوم تطلع فيه الشمس: تعدل بين اثنين صدقة، وتعين الرجل في دابته فتحمله عليها أو ترفع له عليها متاعه صدقة، والكلمة الطيبة صدقة، وبكل خطوة تمشيها إلى الصلاة صدقة، وتميط الأذى عن الطريق صدقة\".",
        "explanation": "هذا الحديث يبين أن الصدقة تشمل كل عمل صالح، وأن المسلم يؤجر على كل عمل يقوم به ابتغاء وجه الله تعالى.",
        "narrator": "رواه البخاري ومسلم"
    },
    {
        "id": 27,
        "hadithNumber": "الحديث السابع والعشرون",
        "hadithText": "عن النواس بن سمعان رضي الله عنه عن النبي صلى الله عليه وسلم قال: \"البر حسن الخلق، والإثم ما حاك في نفسك وكرهت أن يطلع عليه الناس\".",
        "explanation": "هذا الحديث يبين أن البر هو حسن الخلق، وأن الإثم ما حاك في النفس وكره الإنسان أن يطلع عليه الناس.",
        "narrator": "رواه مسلم"
    },
    {
        "id": 28,
        "hadithNumber": "الحديث الثامن والعشرون",
        "hadithText": "عن أبي نجيح العرباض بن سارية رضي الله عنه قال: وعظنا رسول الله صلى الله عليه وسلم موعظة بليغة وجلت منها القلوب وذرفت منها العيون، فقلنا: يا رسول الله، كأنها موعظة مودع فأوصنا. قال: \"أوصيكم بتقوى الله، والسمع والطاعة وإن تأمر عليكم عبد، فإنه من يعش منكم فسيرى اختلافاً كثيراً، فعليكم بسنتي وسنة الخلفاء الراشدين المهديين، عضوا عليها بالنواجذ، وإياكم ومحدثات الأمور، فإن كل بدعة ضلالة\".",
        "explanation": "هذا الحديث يبين وجوب تقوى الله تعالى، والسمع والطاعة لولاة الأمور، والتمسك بسنة النبي صلى الله عليه وسلم وسنة الخلفاء الراشدين، والتحذير من البدع.",
        "narrator": "رواه أبو داود والترمذي"
    },
    {
        "id": 29,
        "hadithNumber": "الحديث التاسع والعشرون",
        "hadithText": "عن معاذ بن جبل رضي الله عنه قال: قلت: يا رسول الله، أخبرني بعمل يدخلني الجنة ويباعدني عن النار. قال: \"لقد سألت عن عظيم، وإنه ليسير على من يسره الله عليه: تعبد الله لا تشرك به شيئاً، وتقيم الصلاة، وتؤتي الزكاة، وتصوم رمضان، وتحج البيت\". ثم قال: \"ألا أدلك على أبواب الخير؟ الصوم جنة، والصدقة تطفئ الخطيئة كما يطفئ الماء النار، وصلاة الرجل من جوف الليل\". ثم تلا: {تتجافى جنوبهم عن المضاجع} حتى بلغ {يعملون}. ثم قال: \"ألا أخبرك برأس الأمر وعموده وذروة سنامه؟\" قلت: بلى يا رسول الله. قال: \"رأس الأمر الإسلام، وعموده الصلاة، وذروة سنامه الجهاد\". ثم قال: \"ألا أخبرك بملاك ذلك كله؟\" قلت: بلى يا رسول الله. فأخذ بلسانه قال: \"كف عليك هذا\". قلت: يا نبي الله، وإنا لمؤاخذون بما نتكلم به؟ فقال: \"ثكلتك أمك يا معاذ، وهل يكب الناس في النار على وجوههم - أو قال: على مناخرهم - إلا حصائد ألسنتهم؟\".",
        "explanation": "هذا الحديث يبين الأعمال التي تدخل الجنة وتباعد عن النار، وأن رأس الأمر الإسلام، وعموده الصلاة، وذروة سنامه الجهاد، وأن ملاك ذلك كله حفظ اللسان.",
        "narrator": "رواه الترمذي"
    },
    {
        "id": 30,
        "hadithNumber": "الحديث الثلاثون",
        "hadithText": "عن أبي ثعلبة الخشني جرثوم بن ناشر رضي الله عنه عن رسول الله صلى الله عليه وسلم قال: \"إن الله فرض فرائض فلا تضيعوها، وحد حدوداً فلا تعتدوها، وحرم أشياء فلا تنتهكوها، وسكت عن أشياء رحمة لكم غير نسيان فلا تبحثوا عنها\".",
        "explanation": "هذا الحديث يبين أن الله تعالى فرض فرائض وحد حدوداً وحرم أشياء، وأن المسلم يجب عليه أن يلتزم بها ولا يتجاوزها.",
        "narrator": "رواه الدارقطني"
    },
    {
        "id": 31,
        "hadithNumber": "الحديث الحادي والثلاثون",
        "hadithText": "عن أبي العباس سعد بن أبي وقاص رضي الله عنه قال: سمعت رسول الله صلى الله عليه وسلم يقول: \"من سعادة ابن آدم استخارة الله، ومن سعادة ابن آدم رضاه بما قضى الله، ومن شقوة ابن آدم تركه استخارة الله، ومن شقوة ابن آدم سخطه بما قضى الله\".",
        "explanation": "هذا الحديث يبين أن من سعادة الإنسان استخارة الله تعالى والرضا بقضائه، وأن من شقاوته ترك الاستخارة والسخط على القضاء.",
        "narrator": "رواه الترمذي"
    },
    {
        "id": 32,
        "hadithNumber": "الحديث الثاني والثلاثون",
        "hadithText": "عن أبي سعيد الخدري رضي الله عنه قال: سمعت رسول الله صلى الله عليه وسلم يقول: \"من رأى منكم منكراً فليغيره بيده، فإن لم يستطع فبلسانه، فإن لم يستطع فبقلبه، وذلك أضعف الإيمان\".",
        "explanation": "هذا الحديث يبين وجوب تغيير المنكر باليد أولاً، فإن لم يستطع فباللسان، فإن لم يستطع فبالقلب، وأن ذلك من الإيمان.",
        "narrator": "رواه مسلم"
    },
    {
        "id": 33,
        "hadithNumber": "الحديث الثالث والثلاثون",
        "hadithText": "عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: \"لا تحاسدوا، ولا تناجشوا، ولا تباغضوا، ولا تدابروا، ولا يبع بعضكم على بيع بعض، وكونوا عباد الله إخواناً، المسلم أخو المسلم، لا يظلمه ولا يخذله ولا يحقره، التقوى هاهنا - ويشير إلى صدره ثلاث مرات - بحسب امرئ من الشر أن يحقر أخاه المسلم، كل المسلم على المسلم حرام: دمه وماله وعرضه\".",
        "explanation": "هذا الحديث يبين تحريم الحسد والنجش والبغضاء والتدابر والبيع على البيع، وأن المسلمين إخوان، وأن دم المسلم وماله وعرضه حرام على المسلم.",
        "narrator": "رواه مسلم"
    },
    {
        "id": 34,
        "hadithNumber": "الحديث الرابع والثلاثون",
        "hadithText": "عن أبي سعيد الخدري رضي الله عنه قال: سمعت رسول الله صلى الله عليه وسلم يقول: \"من رأى منكم منكراً فليغيره بيده، فإن لم يستطع فبلسانه، فإن لم يستطع فبقلبه، وذلك أضعف الإيمان\".",
        "explanation": "هذا الحديث يبين وجوب تغيير المنكر باليد أولاً، فإن لم يستطع فباللسان، فإن لم يستطع فبالقلب، وأن ذلك من الإيمان.",
        "narrator": "رواه مسلم"
    },
    {
        "id": 35,
        "hadithNumber": "الحديث الخامس والثلاثون",
        "hadithText": "عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: \"لا تحاسدوا، ولا تناجشوا، ولا تباغضوا، ولا تدابروا، ولا يبع بعضكم على بيع بعض، وكونوا عباد الله إخواناً، المسلم أخو المسلم، لا يظلمه ولا يخذله ولا يحقره، التقوى هاهنا - ويشير إلى صدره ثلاث مرات - بحسب امرئ من الشر أن يحقر أخاه المسلم، كل المسلم على المسلم حرام: دمه وماله وعرضه\".",
        "explanation": "هذا الحديث يبين تحريم الحسد والنجش والبغضاء والتدابر والبيع على البيع، وأن المسلمين إخوان، وأن دم المسلم وماله وعرضه حرام على المسلم.",
        "narrator": "رواه مسلم"
    },
    {
        "id": 36,
        "hadithNumber": "الحديث السادس والثلاثون",
        "hadithText": "عن أبي هريرة رضي الله عنه عن النبي صلى الله عليه وسلم قال: \"من نفس عن مؤمن كربة من كرب الدنيا نفس الله عنه كربة من كرب يوم القيامة، ومن يسر على معسر يسر الله عليه في الدنيا والآخرة، ومن ستر مسلماً ستره الله في الدنيا والآخرة، والله في عون العبد ما كان العبد في عون أخيه، ومن سلك طريقاً يلتمس فيه علماً سهل الله له به طريقاً إلى الجنة، وما اجتمع قوم في بيت من بيوت الله يتلون كتاب الله ويتدارسونه بينهم إلا نزلت عليهم السكينة، وغشيتهم الرحمة، وحفتهم الملائكة، وذكرهم الله فيمن عنده، ومن بطأ به عمله لم يسرع به نسبه\".",
        "explanation": "هذا الحديث يبين فضل إغاثة الملهوف، والتيسير على المعسر، وستر المسلم، وتعليم العلم، وتلاوة القرآن، وأن العمل هو الذي يرفع الإنسان.",
        "narrator": "رواه مسلم"
    },
    {
        "id": 37,
        "hadithNumber": "الحديث السابع والثلاثون",
        "hadithText": "عن ابن عباس رضي الله عنهما عن رسول الله صلى الله عليه وسلم فيما يرويه عن ربه تبارك وتعالى قال: \"إن الله كتب الحسنات والسيئات، ثم بين ذلك: فمن هم بحسنة فلم يعملها كتبها الله عنده حسنة كاملة، وإن هم بها فعملها كتبها الله عنده عشر حسنات إلى سبعمائة ضعف إلى أضعاف كثيرة، وإن هم بسيئة فلم يعملها كتبها الله عنده حسنة كاملة، وإن هم بها فعملها كتبها الله سيئة واحدة\".",
        "explanation": "هذا الحديث يبين أن الله تعالى يكتب الحسنات والسيئات، وأن من هم بحسنة فلم يعملها كتبها الله حسنة كاملة، وإن هم بها فعملها كتبها الله عشر حسنات إلى سبعمائة ضعف، وإن هم بسيئة فلم يعملها كتبها الله حسنة كاملة، وإن هم بها فعملها كتبها الله سيئة واحدة.",
        "narrator": "رواه البخاري ومسلم"
    },
    {
        "id": 38,
        "hadithNumber": "الحديث الثامن والثلاثون",
        "hadithText": "عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: \"إن الله تعالى قال: من عادى لي ولياً فقد آذنته بالحرب، وما تقرب إلي عبدي بشيء أحب إلي مما افترضت عليه، وما يزال عبدي يتقرب إلي بالنوافل حتى أحبه، فإذا أحببته كنت سمعه الذي يسمع به، وبصره الذي يبصر به، ويده التي يبطش بها، ورجله التي يمشي بها، وإن سألني لأعطينه، ولئن استعاذني لأعيذنه\".",
        "explanation": "هذا الحديث يبين أن من عادى ولياً لله فقد آذنه الله بالحرب، وأن أفضل ما يتقرب به العبد إلى الله الفرائض، ثم النوافل، وأن الله تعالى يحب من يتقرب إليه بالنوافل، وأنه إذا أحب عبداً كان سمعه وبصره ويده ورجله.",
        "narrator": "رواه البخاري"
    },
    {
        "id": 39,
        "hadithNumber": "الحديث التاسع والثلاثون",
        "hadithText": "عن ابن عباس رضي الله عنهما قال: قال رسول الله صلى الله عليه وسلم: \"إن الله تجاوز لي عن أمتي الخطأ والنسيان وما استكرهوا عليه\".",
        "explanation": "هذا الحديث يبين أن الله تعالى تجاوز عن الأمة الخطأ والنسيان وما استكرهوا عليه، وأن ذلك من رحمة الله تعالى بهم.",
        "narrator": "رواه ابن ماجه"
    },
    {
        "id": 40,
        "hadithNumber": "الحديث الأربعون",
        "hadithText": "عن ابن عمر رضي الله عنهما قال: أخذ رسول الله صلى الله عليه وسلم بمنكبي فقال: \"كن في الدنيا كأنك غريب أو عابر سبيل\". وكان ابن عمر رضي الله عنهما يقول: إذا أمسيت فلا تنتظر الصباح، وإذا أصبحت فلا تنتظر المساء، وخذ من صحتك لمرضك، ومن حياتك لموتك.",
        "explanation": "هذا الحديث يبين أن المسلم يجب عليه أن يكون في الدنيا كالغريب أو عابر سبيل، وأن يأخذ من صحته لمرضه، ومن حياته لموته.",
        "narrator": "رواه البخاري"
    }
]