import 'package:flutter/material.dart';
import 'package:serat/imports.dart';

class Food2 extends StatelessWidget {
  const Food2({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      body: BlocProvider(
        create: (context) => AzkarCubit(),
        child: const AzkarModelView(
          title: 'بعد الطعام',
          azkarList: [
            'الْحَمْدُ لِلَّهِ الَّذِي كَفَانَا وَأَرْوَانَا غَيْرَ مَكْفِيٍّ وَلَا مَكْفُورٍ " . وَقَالَ مَرَّةً : الْحَمْدُ لِلَّهِ رَبِّنَا غَيْرَ مَكْفِيٍّ وَلَا مُوَدَّعٍ وَلَا مُسْتَغْنًى رَبَّنَا',
            'الْحَمْدُ لِلَّهِ الَّذِي أَطْعَمَ وَسَقَى وَسَوَّغَهُ وَجَعَلَ لَهُ مَخْرَجًا',
            'الْحَمْدُ لِلَّهِ الَّذِي أَطْعَمَنِي هَذَا الطَّعَامَ وَرَزَقَنِيهِ مِنْ غَيْرِ حَوْلٍ مِنِّي وَلَا قُوَّةٍ',
            'الْحَمْدُ لِلَّهِ الَّذِي هَدَانَا ، وَأَطْعَمَنَا ، وَسَقَانَا ، وَنَعَّمَنَا ، اللَّهُ أَكْبَرُ ، اللَّهُمَّ أَلْفَتْنَا نِعْمَتُكَ بِكُلِّ شَرٍّ ، فَأَصْبَحْنَا مِنْهَا ، وَأَمْسَيْنَا بِكُلِّ خَيْرٍ ، نَسْأَلُكَ تَمَامَهَا وَشُكْرَهَا ، لَا خَيْرَ إِلَّا خَيْرُكَ ، وَلَا إِلَهَ غَيْرُكَ ، إِلَهَ الصَّالِحِينَ ، وَرَبَّ الْعَالَمِينَ ، الْحَمْدُ لِلَّهِ ، وَلَا إِلَهَ إِلَّا اللَّهُ ، مَا شَاءَ اللَّهُ ، وَلَا قُوَّةَ إِلَّا بِاللَّهِ ، اللَّهُمَّ بَارِكْ لَنَا فِيمَا رَزَقْتَنَا ، وَقِنَا عَذَابَ النَّارِ .',
          ],
          maxValues: [1],
        ),
      ),
    );
  }
}
